In [2]:
import duckdb  # noqa: F401

In [3]:
con = duckdb.connect(database='../data/dados_duckdb.db', read_only=False)

In [4]:
df = con.execute("SELECT * FROM produtos").fetch_df()
df

      id nm_produto id_categoria  id_fornecedor  vl_preco
0  10004      SERRA         BT50            100     200.0
1  10003      PREGO         BT10            100      50.0
2  10001   PARAFUSO         BT10            100     100.0
3  10005     MACHAD         BT10            100      50.0
4  10002    MARTELO         BT50            100    1500.0

In [5]:
df2 = df.drop(columns=[ 'id_categoria', 'id_fornecedor' ])
df2

      id nm_produto  vl_preco
0  10004      SERRA     200.0
1  10003      PREGO      50.0
2  10001   PARAFUSO     100.0
3  10005     MACHAD      50.0
4  10002    MARTELO    1500.0

In [6]:
tabela = """ 
CREATE TABLE IF NOT EXISTS dim_produtos (
        id BIGINT,
        nm_produto TEXT,
        vl_preco FLOAT
)
"""

In [10]:
con.execute(tabela)

In [ ]:
con.execute("INSERT INTO  dim_produtos SELECT * FROM df2")

In [7]:
consulta = con.execute("SELECT * FROM dim_produtos").fetch_df()
consulta

      id nm_produto  vl_preco
0  10004      SERRA     200.0
1  10003      PREGO      50.0
2  10001   PARAFUSO     100.0
3  10005     MACHAD      50.0
4  10002    MARTELO    1500.0

In [8]:
con.close()